Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.com"><ns2:nalogZaPlacanje datumNaloga="2017-06-18" datumValute="2017-06-18+02:00" hitno="false"><ns2:idPoruke><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>xx+ZLipQEmqfUH+t/BlHH/MRNWlMum9r3wlmjzG6y99apJD8uHxfc5tEYwxfWBvY4sq6vga5jbFb&#13;
2QHuSWtXKmgTGrMU7BN/DxILT2d5cfkAuKbn3nJ+TO+JBKUEvEAOCPywsM4cQ++FUZ3daGx8bAhg&#13;
5tDH9vsHJkkWfrEX+QA=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>BaKL0pJqG39yIYbAGFQdLO/ecTCdXme9</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:idPoruke><ns2:duznik-nalogodavac>levi</ns2:duznik-nalogodavac><ns2:svrhaPlacanja>Svrha placanja</ns2:svrhaPlacanja><ns2:primalac-poverilac>ftn</ns2:primalac-poverilac><ns2:racunDuznika>200636547896321456</ns2:racunDuznika><ns2:modelZaduzenja>92</ns2:modelZaduzenja><ns2:pozivNaBrojZaduzenja>41247412</ns2:pozivNaBrojZaduzenja><ns2:racunPoverioca>400254547845612156</ns2:racunPoverioca><ns2:modelOdobrenja>97</ns2:modelOdobrenja><ns2:pozivNaBrojOdobrenja>147541214</ns2:pozivNaBrojOdobrenja><ns2:iznos>25000</ns2:iznos><ns2:oznakaValute>RSD</ns2:oznakaValute></ns2:nalogZaPlacanje></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>oMblvrFXI9jpeZ1oHLapzJ1DbNA=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
yQ+gLQwCoqzEEgBIaB8SB726NbEWRL4GcCt5MIITgIQK7hpI2l8P4b/kkWuv3JmSxxGJgdY3hLRP&#13;
C7CDFqPKDO1Rb9JqzPZiJ2fd9/HDe1BrtH5ehCHvBr8agTSFneMdrMcxexa+pvK/k8eYbTMoORIY&#13;
Egzv89P7f4meArcH2oY=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>